Итоговый_проект_2/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
  </enumValues>
  <enumValues>
    <name>НДС20</name>
  </enumValues>
</mdclass:Enum>

Итоговый_проект_2/src/CommonModules/НДСКлиентСервер/Module.bsl
Функция СуммаНДСПоСтавке(Сумма, СтавкаНДС)Экспорт

	//Создать функцию СуммаНДСПоСтавке(Сумма, СтавкаНДС), 
	//возвращающую сумму НДС, рассчитанную от суммы по ставке согласно требованиям. 
	//Чтобы обеспечить работоспособность на клиенте, 
	//для получения значений ставок НДС используйте функцию ПредопределенноеЗначение()	
	
	
	//НДС рассчитывается по ставкам, определяемым по значению перечисления 
	//СтавкиНДС (БезНДС - 0%, НДС10 - 10%, НДС20 - 20%). 
	//Сумма НДС определяется умножением суммы на ставку 
	//(т.е. НДС рассчитывается по схеме "в том числе", например, 
	//для ставки 20% и суммы 120 р сумма НДС будет равна 120 * 0.2 / (1 + 0.2) = 20.
	
	Если СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС") Тогда
		Ставка = 0;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10") Тогда
		Ставка = 0.1;
	ИначеЕсли СтавкаНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20") Тогда
		Ставка = 0.2;     
	КонецЕсли;
	
	НДС = Сумма * Ставка / (1 + Ставка);
	
	Возврат НДС;
	
КонецФункции
